{"class_name": "Model", "keras_version": "2.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, 161], "name": "the_input", "sparse": false}, "inbound_nodes": [], "name": "the_input"}, {"class_name": "ZeroPadding1D", "config": {"padding": [0, 2048], "trainable": true, "name": "zero_padding1d_1"}, "inbound_nodes": [[["the_input", 0, 0, {}]]], "name": "zero_padding1d_1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_1", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [2], "dilation_rate": [1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [11]}, "inbound_nodes": [[["zero_padding1d_1", 0, 0, {}]]], "name": "conv_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_1"}, "inbound_nodes": [[["conv_1", 0, 0, {}]]], "name": "time_distributed_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "y_pred", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 29, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_2"}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "name": "time_distributed_2"}], "input_layers": [["the_input", 0, 0]], "output_layers": [["time_distributed_2", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}